app/controllers/questions_controller.rb

  def create
    @question = Question.new(params[:question])
    @question.save
---
INSERT INTO "questions" ("answer_a", "answer_b", "answer_c", "answer_d", "correct_answer", "created_at", "question_text", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def show
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "5"]]