app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
  def index
    @topics = Topic.all

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @topic = Topic.find(params[:id])

INSERT INTO "topics" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 12 Nov 2015 00:38:13 UTC +00:00], ["description", "this is the first topics"], ["title", "first topic"], ["updated_at", Thu, 12 Nov 2015 00:38:13 UTC +00:00]]
---
  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 12 Nov 2015 01:55:43 UTC +00:00], ["topic_id", 1], ["updated_at", Thu, 12 Nov 2015 01:55:43 UTC +00:00]]
---
  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create